000_РОЗНИЦА_ЦЕНТР/src/Catalogs/УслугиБанка/УслугиБанка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>УслугиБанка</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>МгновеннаяРассрочка</name>
      <description>Мгновенная рассрочка</description>
    </items>
  </predefined>
  <attributes>
    <name>Банк</name>
    <type>
      <types>CatalogRef.КлассификаторБанков</types>
    </type>
  </attributes>
  <attributes>
    <name>Блокирован</name>
    <comment>Услуга заблокирована</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПрограммы</name>
    <comment>Банковский идентификатор кредитования</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьСкидкиНаценки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КомиссияБанка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодПредоставления</name>
    <comment>Период, например, рассрочки платежа - в платежах (например 6 платежей)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипУслуги</name>
    <type>
      <types>EnumRef.ТипыУслугБанка</types>
    </type>
  </attributes>
  <attributes>
    <name>Эквайрер</name>
    <comment>Эквайрер по умолчанию</comment>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <tabularSections>
    <name>НоменклатураИсключения</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
        <types>CatalogRef.СегментыНоменклатуры</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НоменклатураПредоставления</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
        <types>CatalogRef.СегментыНоменклатуры</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

000_РОЗНИЦА_ЦЕНТР/src/InformationRegisters/ДанныеКредитныхПрограмм/ДанныеКредитныхПрограмм.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДанныеКредитныхПрограмм</name>
  <resources>
    <name>УслугаБанка</name>
    <type>
      <types>CatalogRef.УслугиБанка</types>
    </type>
  </resources>
  <resources>
    <name>Магазин</name>
    <type>
      <types>CatalogRef.Магазины</types>
    </type>
  </resources>
  <resources>
    <name>ДатаДокумента</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Интеграция</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Идентификатор</name>
    <comment>УИ без символов &quot;-&quot;</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>32</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИдентификаторБанка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДокументПродажи</name>
    <type>
      <types>DocumentRef.РеализацияТоваров</types>
      <types>DocumentRef.ЧекККМ</types>
    </type>
  </resources>
  <resources>
    <name>УслугаБанкаПериодПредоставления</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаКредита</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаКредитаВозврат</name>
    <comment>Сумма, опредённая при возврате товаров от покупателя</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ГарантийноеПисьмоДанные</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>ГарантийноеПисьмоПодтверждено</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыЗаявкиНаОформлениеКредита</types>
    </type>
  </resources>
  <resources>
    <name>ОтветБанка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Отменить</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Проверено</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Отгружено</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДанныеВозвратов</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>ИдентификаторБанкаВозврата</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИдентификаторВозврата</name>
    <comment>УИ без символов &quot;-&quot;</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>32</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОтветБанкаВозврат</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтатусВозврата</name>
    <type>
      <types>EnumRef.СтатусыЗаявкиНаОформлениеКредита</types>
    </type>
  </resources>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>СчетНаОплатуПокупателю</name>
    <type>
      <types>DocumentRef.СчетНаОплатуПокупателю</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

000_РОЗНИЦА_ЦЕНТР/src/Catalogs/УслугиБанка/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Функция РеквизитыУслуги(УслугаБанка, СчетНаОплатуПокупателю = Неопределено)	Экспорт

	Если НЕ ПривилегированныйРежим() Тогда

		УстановитьПривилегированныйРежим(Истина);

	КонецЕсли;

	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ТаблицаВедущая.Ссылка КАК УслугаБанка,
	|	ТаблицаВедущая.ПериодПредоставления КАК ПериодПредоставления,
	|	ТаблицаВедущая.Наименование КАК Наименование,
	|	ТаблицаВедущая.ТипУслуги КАК ТипУслуги,
	|	ЕСТЬNULL(ТаблицаВедущая.Банк.ТипИнтернетБанкинга, ЗНАЧЕНИЕ(Перечисление.ТипыИнтернетБанкинга.ПустаяСсылка)) КАК ТипИнтернетБанкинга,
	|	ЕСТЬNULL(ТаблицаВедущая.Банк.Интеграция, ЛОЖЬ) КАК Интеграция,
	|	ТаблицаВедущая.ИспользоватьСкидкиНаценки КАК ИспользоватьСкидкиНаценки,
	|	ТаблицаВедущая.Эквайрер КАК Эквайрер,
	|	ТаблицаВедущая.Описание КАК Описание,
	|	ИСТИНА КАК Проверено,
	|	ЕСТЬNULL(ТаблицаВедущая.Банк.СуммаМинимальногоКредита, 0) КАК СуммаМинимальногоКредита,
	|	ЕСТЬNULL(ТаблицаПрограмм.СуммаДокумента, 0) КАК СуммаДокумента,
	|	ЕСТЬNULL(ТаблицаПрограмм.СуммаКредита, 0) КАК СуммаКредита,
	|	ЕСТЬNULL(ТаблицаПрограмм.СуммаКредитаВозврат, 0) КАК СуммаКредитаВозврат,
	|	ТаблицаПрограмм.ДокументПродажи КАК ДокументПродажи,
	|	ЛОЖЬ КАК СтараяСхемаКредита
	|ПОМЕСТИТЬ ТаблицаПрограммы
	|ИЗ
	|	Справочник.УслугиБанка КАК ТаблицаВедущая
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеКредитныхПрограмм КАК ТаблицаПрограмм
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетНаОплатуПокупателю КАК ТаблицаСчета
	|			ПО ТаблицаПрограмм.СчетНаОплатуПокупателю = ТаблицаСчета.Ссылка
	|		ПО (ТаблицаПрограмм.СчетНаОплатуПокупателю = &СчетНаОплатуПокупателю)
	|			И ТаблицаВедущая.Ссылка = ТаблицаПрограмм.УслугаБанка
	|ГДЕ
	|	ТаблицаВедущая.Ссылка = &УслугаБанка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаПрограммы.УслугаБанка КАК УслугаБанка,
	|	ТаблицаПрограммы.ПериодПредоставления КАК ПериодПредоставления,
	|	ТаблицаПрограммы.Наименование КАК Наименование,
	|	ТаблицаПрограммы.ТипУслуги КАК ТипУслуги,
	|	ТаблицаПрограммы.ТипИнтернетБанкинга КАК ТипИнтернетБанкинга,
	|	ТаблицаПрограммы.ИспользоватьСкидкиНаценки КАК ИспользоватьСкидкиНаценки,
	|	ТаблицаПрограммы.Эквайрер КАК Эквайрер,
	|	ТаблицаПрограммы.Описание КАК Описание,
	|	ТаблицаПрограммы.Проверено КАК Проверено,
	|	ТаблицаПрограммы.СуммаМинимальногоКредита КАК СуммаМинимальногоКредита,
	|	ТаблицаПрограммы.СуммаДокумента КАК СуммаДокумента,
	|	ТаблицаПрограммы.СуммаКредита КАК СуммаКредита,
	|	ТаблицаПрограммы.СуммаКредитаВозврат КАК СуммаКредитаВозврат,
	|	ТаблицаПрограммы.ДокументПродажи КАК ДокументПродажи,
	|	ТаблицаПрограммы.СтараяСхемаКредита КАК СтараяСхемаКредита
	|ИЗ
	|	ТаблицаПрограммы КАК ТаблицаПрограммы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаОплаты.НомерСтроки КАК НомерСтроки,
	|	ТаблицаОплаты.ВидОплаты КАК ВидОплаты,
	|	ТаблицаОплаты.Сумма КАК Сумма
	|ИЗ
	|	Документ.ЧекККМ.Оплата КАК ТаблицаОплаты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаПрограммы КАК Фильтр
	|		ПО ТаблицаОплаты.Ссылка = Фильтр.ДокументПродажи
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ТаблицаПрограммы"
	);
	Запрос.УстановитьПараметр("УслугаБанка", УслугаБанка);
	Запрос.УстановитьПараметр("СчетНаОплатуПокупателю", СчетНаОплатуПокупателю);

	Результаты = Запрос.ВыполнитьПакет();
	Реквизиты = Результаты[1].Выбрать();
	Реквизиты.Следующий();

	СоставРеквизитов = ОбщегоНазначенияРТ.СоздатьСтруктуруПоСтрокеВыборки(Результаты[1], Реквизиты, Истина);

	СоставРеквизитов.Вставить("Оплата", Новый Массив);
	СоставРеквизитов.Вставить("ТоварыДоступные", Новый Массив);

	Если НЕ Результаты[2].Пустой() Тогда

		ОплатаВыборка = Результаты[2].Выбрать();

		Пока ОплатаВыборка.Следующий() Цикл

			СоставРеквизитов.Оплата.Добавить(
				Новый Структура(
					"ВидОплаты, Сумма"
					, ОплатаВыборка.ВидОплаты
					, ОплатаВыборка.Сумма
				)
			); 

		КонецЦикла;

	КонецЕсли;
	
	Возврат СоставРеквизитов;

КонецФункции

Функция КредитнаяПрограмма(IDC, ЗначениеГлубины)	Экспорт

	СоставПрограммы = Новый Структура(
		"УслугаБанка, УслугаБанкаПериодПредоставления"
		, Справочники.УслугиБанка.ПустаяСсылка()
		, 0
	);

	Если НЕ ПустаяСтрока(IDC) И СтрДлина(IDC) = 36 Тогда

		Попытка

			УИ = Новый УникальныйИдентификатор(IDC);
			СоставПрограммы.УслугаБанка = Справочники.УслугиБанка.ПолучитьСсылку(УИ);
			СоставПрограммы.УслугаБанкаПериодПредоставления = ЗначениеГлубины;

		Исключение

			ТекстОшибки = ОписаниеОшибки();

		КонецПопытки;

	КонецЕсли;

	Возврат СоставПрограммы;

КонецФункции

#КонецЕсли
